@handler.add(MessageEvent, message=TextMessage)
def on_text_message(event):
    text = event.message.text.strip()

    if text == "ไฟดับ":
        reply = (
            "📢 ประกาศการไฟฟ้าส่วนภูมิภาค\n"
            "แจ้งดับกระแสไฟฟ้า\n"
            "📅 วันที่ 14 มกราคม 2569\n"
            "⏰ เวลา 09:00 - 11:00 น.\n"
            "📍 พื้นที่ บ้านหนองขาม ซอย 3\n"
            "ขออภัยในความไม่สะดวก\n"
            "☎ โทร 032604280 1129"
        )

        line_bot_api.reply_message(
            event.reply_token,
            TextSendMessage(text=reply)
        )
        return

    line_bot_api.reply_message(
        event.reply_token,
        TextSendMessage(text="พิมพ์คำว่า ไฟดับ เพื่อดูประกาศ")
    )

